___


<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

___

<h1><p style="text-align: center;">DA with Python Lab Session - 4 (Regex) </p><h1>


### Expressions :
***

`\d`                         Any numeric digit from `0` to `9`.
                           
`\D`                         Matches any character which is not a decimal digit. 
                           This is the opposite of `\d`.
                           
`\w`                         Any letter, numeric digit, or the underscore
                           character.  (Think of this as matching
                           "word" characters.)
                           
`\W`                         Any character that is not a letter,
                           numeric digit, or the underscore character.
                           
`\s`                         Any space, tab, or newline character.  (
                           Think of this as matching white-space
                           characters.)
                           
`\S`                         Any character that is not a space, tab,
                           or newline.
***

### Import necessary libraries

import re
import pandas as pd

### Find numeric digits with search function

In [229]:
text = "A78L41K"

In [230]:
num=re.search('\d\d',text)

In [231]:
print(num)

<re.Match object; span=(1, 3), match='78'>

In [232]:
num.group()

'78'

### Find non decimal digits with search function

In [235]:
text = "8PM19MIN"

In [236]:
nondeci = re.search("\D", text)
print(nondeci.group())

P

### Find phone number pattern

In [243]:
text = 'My phone number is 5556667777'

In [244]:
# output = re.search("(\d\d\d\d\d\d\d\d\d\d)", text)
output = re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text) #"\d\d\d\d\d\d\d\d\d\d" alternatively, if you want all at once. 

print(output.group(0))

5556667777

### Grouping with parentheses and find areaCode,mainNumber print

In [2]:
text = 'My phone number is 415-555-1212'

In [3]:
output = re.search('(\d\d\d)-(\d\d\d-\d\d\d\d)', text)
print(output.group(2))

555-1212

In [4]:
x=re.split('\s',text)
x

['My', 'phone', 'number', 'is', '415-555-1212']

### Escaping parentheses and create 2 group -> first group:(415) second group:555-1212 print

In [249]:
text = 'My phone number is (415) 555-1212'

In [250]:
output = re.search("(\(\d\d\d\)) (\d\d\d-\d\d\d\d)", text)

print(output.group(1))
print(output.group(2))

(415)
555-1212

In [251]:
text = 'My phone number is (415) 555-1212'
with open ("text.txt", "w") as file:
    file.write(text)

In [252]:
with open("text.txt", "r") as file:
    txt = file.read()
print(txt,"\n")

output = re.search('(\(\d\d\d\)) (\d\d\d-\d\d\d\d)',txt) 

print(f"first group : {output.group(1)}")
print(f"second group :{output.group(2)}")

My phone number is (415) 555-1212

first group : (415)
second group :555-1212

### Extract numbers from text

In [253]:
value = "O 1, t 10, o 100. 100000"

In [254]:
output = re.findall("\d{1,6}", value)

print(output)

['1', '10', '100', '100000']

### Remove anything other than digits and print

In [272]:
phone = "2004-959-559 # This is Phone Number"

In [273]:
output = re.sub("\D", "", phone)
print(output)

2004959559

### Remove anything other than digits and replace with "."

In [274]:
phone = "2004-959-559 # This is Phone Number"

In [277]:
output = re.sub("\D", ".", phone)
print(output)

2004.959.559.......................

### Remove digits and replace with "."

In [278]:
phone = "2004-959-559 # This is Phone Number"

In [279]:
output = re.sub("\d", ".", phone)
print(output)

....-...-... # This is Phone Number

### Special Characters
___

``"[]"``	  A set of characters	``"[a-m]"``

``"\"``	      Signals a special sequence (can also be used to escape special characters)

``"."``	      Any character (except newline character)

``"^"``	      Starts with	``"^hello"``

``"$"``	      Ends with	``"world$"``

``"*"``	      Zero or more occurrences

`"+"`	      One or more occurrences

`"{}"`	  Exactly the specified number of occurrences

`"|"`	      Either or	`"falls|stays"`

`"()"`	  Capture and group
___

### Extract numbers as a list from the text

In [280]:
txt = "1 person against 100 people"

In [281]:
output = re.findall("\d+", txt)
print(output)
print(f"{output[0]} versus {output[1]}")

['1', '100']
1 versus 100

### Check if the string starts with 'hello' if yes print Yes, the string starts with 'hello' if no No match :

In [282]:
txt = "hello world"

In [283]:
output = re.findall("^hello", txt) # change world to hello to see or use match instead
if output:
    print("Yes starts with hello")
else:
    print("No")

Yes starts with hello

### Check if the string ends with 'world' if yes print Yes, the string ends with 'world' if no No match :

In [284]:
txt = "hello world"

In [285]:

output = re.findall("world$",txt)
if output:
    print("Yes starts with hello")
else:
    print("No")

Yes starts with hello

### Check a serie has number or not

In [286]:
s = pd.Series(['a3', 'b4', 'c5', 'd'])

In [287]:
s.str.contains("(\d)")

C:\Users\igdem\anaconda3\lib\site-packages\pandas\core\strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

0     True
1     True
2     True
3    False
dtype: bool

In [288]:
s.apply(lambda x : True if re.search("\d", x) else False)

0     True
1     True
2     True
3    False
dtype: bool

### How many letters does each serie item have?

In [289]:
s = pd.Series(["aaa" ,"bbabb", "cccaccc"])

In [290]:
s.str.count("\w") # try "a" "aa" "ab"

0    3
1    5
2    7
dtype: int64

### Extract just numbers

In [313]:
s = pd.Series(['a3', 'b4', 'c5'])

In [300]:
s.str.extract('(\d)')

   0
0  3
1  4
2  5

### Extract just letters

In [320]:
s = pd.Series(['a3aa', 'b4aa', 'c5aa'])

In [322]:
s

0    a3aa
1    b4aa
2    c5aa
dtype: object

In [324]:
s.str.extract('(\w)\d(\w)(\w)')

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

### Extract first number

In [340]:
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

In [343]:
s

0       40 l/100 km (comb)
1       38 l/100 km (comb)
2      6.4 l/100 km (comb)
3     8.3 kg/100 km (comb)
4     5.1 kg/100 km (comb)
5      5.4 l/100 km (comb)
6      6.7 l/100 km (comb)
7      6.2 l/100 km (comb)
8      7.3 l/100 km (comb)
9      6.3 l/100 km (comb)
10     5.7 l/100 km (comb)
11     6.1 l/100 km (comb)
12     6.8 l/100 km (comb)
13     7.5 l/100 km (comb)
14     7.4 l/100 km (comb)
15    3.6 kg/100 km (comb)
16       0 l/100 km (comb)
17     7.8 l/100 km (comb)
dtype: object

In [348]:
s.str.extract('(\d\d\d)')

      0
0   100
1   100
2   100
3   100
4   100
5   100
6   100
7   100
8   100
9   100
10  100
11  100
12  100
13  100
14  100
15  100
16  100
17  100

In [342]:
result = s.str.extract('(\d\d|\d.\d|\d)')
result

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

### Extract first and second number

In [202]:
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

In [203]:
result2 = s.str.extract('(\d\d|\d.\d|\d).+(\d\d\d)')
result2

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100

In [204]:
result = s.str.extract('(^\d*.\d*) \w*/(\d*)')
result

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100

### Extract date

In [205]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',                                 
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',                                                 
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [206]:
result = s.str.extract("(\d\d).(\d\d\d\d)")
result2 = s.str.extract("(\d{2}).(\d{4})")
result3 = s.str.extract("(\d*).(\d*)")
result4 = s.str.extract("(\d\d)/(\d*)")
result5 = s.str.extract("(\d\d)/(\d\d\d\d)")
result5

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

### Extract date with a different way

In [207]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',                                 
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',                                                 
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [208]:
result = s.str.extract('(\d{1,2})/(\d{4})')
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

### Extract date and \n\n -> 4.9

In [209]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',                                 
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',                                                 
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [210]:
result = s.str.extract('(\d{2})/(\d{4})\s\s(\d{3}|\d.\d)')
result

     0     1    2
0   06  2020  4.9
1   11  2020  166
2   10  2019  5.3
3   05  2022  6.3
4   07  2019  128
5   06  2022  112
6   01  2022  5.8
7   11  2020  106
8   04  2019  105
9   08  2020  133
10  04  2022  133